/**
 * Коды валют
 */
export enum ECurrency {
  AUD = 'AUD',     // австралийский доллар
  AZN = 'AZN',     // Азербайджанский манат
  GBP = 'GBP',     // Фунт стерлингов Соединенного
  AMD = 'AMD',     // армянский драм
  BYN = 'BYN',     // Белорусский рубль
  BGN = 'BGN',     // Болгарский лев
  BRL = 'BRL',     // Бразильский реал
  HUF = 'HUF',     // Венгерский форинт
  HKD = 'HKD',     // Гонконгский доллар
  DKK = 'DKK',     // Датская крона
  USD = 'USD',     // Доллар США
  EUR = 'EUR',     // Евро
  INR = 'INR',     // индийский рупий
  KZT = 'KZT',     // Казахстанский тенге
  CAD = 'CAD',     // Канадский доллар
  KGS = 'KGS',     // Киргизский сом
  CNY = 'CNY',     // Китайский юань
  MDL = 'MDL',     // Молдайвский лей
  NOK = 'NOK',     // Норвежская крона
  PLN = 'PLN',     // Польский злотый
  RON = 'RON',     // Румынский лей
  XDR = 'XDR',     // Специальные права взаимствования
  SGD = 'SGD',     // Сингапурский доллар
  TJS = 'TJS',     // Таджикский сомони
  TRY = 'TRY',     // Турецкая лира
  TMT = 'TMT',     // Новый туркменский манат
  UZS = 'UZS',     // Узбекский сум
  UAH = 'UAH',     // Украиская гривна
  СZK = 'CZK',     // Чешская крона
  SEK = 'SEK',     // Шведская крона
  CHF = 'CHF',     // Швейцарский франк
  ZAR = 'ZAR',     // Южноафриканский рэнд
  KRW = 'KRW',     // Вон Республики Корея
  JPY = 'JPY'      // Японская иена
}
